# Rpstr_RemoveValues

## Description
Removes all values from the VectorScript value repository.

```pascal
PROCEDURE Rpstr_RemoveValues;
```

```python

def vs.Rpstr_RemoveValues():
    return None
```

## See Also
VS Functions:
Rpstr_RemoveValues| Rpstr_RemoveValue| Rpstr_GetValueBool| Rpstr_SetValueBool| Rpstr_GetValueInt| Rpstr_SetValueInt| Rpstr_GetValueReal| Rpstr_SetValueReal| Rpstr_GetValueStr| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012
## Category
* Utility